Repository: soul99soul-glitch/AmberNovel-iOS
Catalog: iosApp/iosApp/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, zh_hans, zh_hant

# 聊天字体大小
source: Chat font size
ja: チャットの文字サイズ
ko: 채팅 글꼴 크기
ru: Размер шрифта чата
zh_hans: 聊天字体大小
zh_hant: 聊天字型大小

# 能力对比
source: Capability comparison
ja: 機能比較
ko: 기능 비교
ru: Сравнение возможностей
zh_hans: 能力对比
zh_hant: 能力對比

# 能力矩阵
source: Capability matrix
ja: 機能マトリクス
ko: 기능 매트릭스
ru: Матрица возможностей
zh_hans: 能力矩阵
zh_hant: 能力矩陣

# 脚本执行
source: Script execution
ja: スクリプト実行
ko: 스크립트 실행
ru: Выполнение скрипта
zh_hans: 脚本执行
zh_hant: 腳本執行

# 自定义
source: Custom
ja: カスタム
ko: 사용자 지정
ru: Пользовательский
zh_hans: 自定义
zh_hant: 自訂

# 自定义 HTML
source: Custom HTML
ja: カスタムHTML
ko: 사용자 지정 HTML
ru: Пользовательский HTML
zh_hans: 自定义 HTML
zh_hant: 自訂 HTML

# 自定义来源
source: Custom source
ja: カスタム出典
ko: 사용자 지정 출처
ru: Пользовательский источник
zh_hans: 自定义来源
zh_hant: 自訂來源

# 自定义画布与强调色
source: Custom canvas & accent color
ja: キャンバスとアクセントカラーをカスタマイズ
ko: 사용자 지정 캔버스 및 강조 색상
ru: Настроить фон и цвет акцента
zh_hans: 自定义画布与强调色
zh_hant: 自訂畫布與強調色

# 自定义站点会保存在本机，Cookie 内容不会在页面中显示。
source: Custom sites are saved on this device; Cookie contents aren't shown on the page.
ja: カスタムサイトはこのデバイスに保存され、Cookie の内容はページに表示されません。
ko: 사용자 지정 사이트는 이 기기에 저장되며, Cookie 내용은 페이지에 표시되지 않습니다.
ru: Пользовательские сайты сохраняются на этом устройстве; содержимое Cookie не отображается на странице.
zh_hans: 自定义站点会保存在本机，Cookie 内容不会在页面中显示。
zh_hant: 自訂網站會儲存在本機，Cookie 內容不會顯示在頁面中。

# 自定义类型名称
source: Custom type name
ja: カスタムタイプ名
ko: 사용자 지정 유형 이름
ru: Название пользовательского типа
zh_hans: 自定义类型名称
zh_hant: 自訂類型名稱

# 自定义资料
source: Custom material
ja: カスタム資料
ko: 사용자 지정 자료
ru: Пользовательские материалы
zh_hans: 自定义资料
zh_hant: 自訂資料

# 至少一条
source: At least one
ja: 最低1件
ko: 최소 1개
ru: Хотя бы один
zh_hans: 至少一条
zh_hant: 至少一條

# 至少需要一名人物档案
source: At least one character profile is required
ja: キャラクタープロフィールが少なくとも1件必要です
ko: 인물 프로필이 하나 이상 필요합니다.
ru: Нужен хотя бы один профиль персонажа
zh_hans: 至少需要一名人物档案
zh_hant: 至少需要一份人物檔案

# 草稿
source: Draft
ja: 草稿
ko: 초안
ru: Черновик
zh_hans: 草稿
zh_hant: 草稿

# 补充说明
source: Add clarification
ja: 補足説明
ko: 추가 설명
ru: Дополнительные пояснения
zh_hans: 补充说明
zh_hant: 補充說明

# 补充这个席位的发言边界和偏好
source: Add speaking boundaries and preferences for this seat
ja: この議席の発言範囲と好みを補足
ko: 이 의석의 발언 범위와 선호를 보완하세요
ru: Уточните границы высказываний и предпочтения для этого участника
zh_hans: 补充这个席位的发言边界和偏好
zh_hant: 補充這個席位的發言邊界與偏好

# 衬线
source: Serif
ja: セリフ
ko: 세리프
ru: С засечками
zh_hans: 衬线
zh_hant: 襯線

# 要通读 %lld 章、约 %lld 字，会分 %lld 次交给模型。检查期间不能生成正文。
source: Read all %lld chapters—about %lld characters—in %lld batches for the model. Manuscript generation is unavailable during the check.
ja: モデルに%lld章、約%lld文字を%lld回に分けて読み込ませます。チェック中は本文を生成できません。
ko: 총 %lld장을 약 %lld자 분량으로 정독하며, 모델에 %lld회로 나누어 전달합니다. 검사 중에는 본문을 생성할 수 없습니다.
ru: Нужно прочитать %lld глав, около %lld символов, и передать модели за %lld раз. Во время проверки нельзя генерировать основной текст.
zh_hans: 要通读 %lld 章、约 %lld 字，会分 %lld 次交给模型。检查期间不能生成正文。
zh_hant: 要通讀 %lld 章、約 %lld 字，會分 %lld 次交給模型。檢查期間不能產生正文。

# 要阅读的主题
source: Topic to read
ja: 読みたいテーマ
ko: 읽을 주제
ru: Тема для чтения
zh_hans: 要阅读的主题
zh_hant: 要閱讀的主題

# 覆盖方式
source: Override mode
ja: 上書き方法
ko: 덮어쓰기 방식
ru: Способ переопределения
zh_hans: 覆盖方式
zh_hant: 覆寫方式

# 观察
source: Observe
ja: 観察
ko: 관찰
ru: Наблюдать
zh_hans: 观察
zh_hant: 觀察

# 观看模式，仅可查看；接管后可操作。
source: View-only mode; take over to interact.
ja: 閲覧モード。表示のみで、制御を引き継ぐと操作できます。
ko: 보기 모드에서는 조회만 가능하며, 제어권을 넘겨받으면 조작할 수 있습니다.
ru: Режим просмотра: только просмотр; после перехвата доступны действия.
zh_hans: 观看模式，仅可查看；接管后可操作。
zh_hant: 觀看模式，僅可檢視；接管後可操作。

# 视觉快照
source: Visual snapshot
ja: ビジュアルスナップショット
ko: 비주얼 스냅샷
ru: Визуальный снимок
zh_hans: 视觉快照
zh_hant: 視覺快照

# 视觉识别中…
source: Recognizing visuals…
ja: 画像認識中…
ko: 시각 인식 중…
ru: Визуальное распознавание…
zh_hans: 视觉识别中…
zh_hant: 視覺辨識中…

# 视觉识别失败：%@
source: Visual recognition failed: %@
ja: 視覚認識に失敗しました：%@
ko: 시각 인식 실패: %@
ru: Визуальное распознавание не удалось: %@
zh_hans: 视觉识别失败：%@
zh_hant: 視覺辨識失敗：%@

# 视觉识别模型没有返回可用内容
source: The visual-recognition model returned no usable content
ja: 視覚認識モデルから利用可能な内容が返されませんでした
ko: 시각 인식 모델이 사용 가능한 내용을 반환하지 않았습니다.
ru: Модель визуального распознавания не вернула пригодных данных
zh_hans: 视觉识别模型没有返回可用内容
zh_hant: 視覺辨識模型沒有回傳可用內容

# 视觉识别模型的服务商不可用
source: The visual-recognition model's provider is unavailable
ja: 視覚認識モデルのサービスプロバイダーを利用できません
ko: 시각 인식 모델 서비스 제공자를 사용할 수 없습니다.
ru: Провайдер модели визуального распознавания недоступен
zh_hans: 视觉识别模型的服务商不可用
zh_hant: 視覺辨識模型的服務提供者無法使用

# 视角可知事实
source: Facts known from this viewpoint
ja: 視点から知り得る事実
ko: 시점에서 알 수 있는 사실
ru: Факты, известные с этой точки зрения
zh_hans: 视角可知事实
zh_hant: 視角可知事實

# 角色
source: Characters
ja: キャラクター
ko: 역할
ru: Персонаж
zh_hans: 角色
zh_hant: 角色

# 角色提示词
source: Role prompt
ja: キャラクタープロンプト
ko: 캐릭터 프롬프트
ru: Промпт роли
zh_hans: 角色提示词
zh_hant: 角色提示詞

# 角色档案不存在
source: Character profile not found
ja: キャラクタープロフィールがありません
ko: 캐릭터 프로필이 존재하지 않습니다
ru: Досье персонажа не существует
zh_hans: 角色档案不存在
zh_hant: 角色檔案不存在

# 解析材料
source: Parsing material
ja: 資料を解析
ko: 자료 분석
ru: Разбор материалов
zh_hans: 解析材料
zh_hant: 解析材料

# 触发条件
source: Trigger conditions
ja: トリガー条件
ko: 트리거 조건
ru: Условия срабатывания
zh_hans: 触发条件
zh_hant: 觸發條件

# 计划状态
source: Plan status
ja: 計画の状態
ko: 계획 상태
ru: Состояние плана
zh_hans: 计划状态
zh_hant: 計畫狀態

# 订阅:%@
source: Subscription: %@
ja: サブスクリプション：%@
ko: 구독:%@
ru: Подписка:%@
zh_hans: 订阅：%@
zh_hant: 訂閱：%@

# 订阅设备传感器
source: Subscribe to device sensors
ja: デバイスセンサーを購読
ko: 기기 센서 구독
ru: Подписаться на датчики устройства
zh_hans: 订阅设备传感器
zh_hant: 訂閱裝置感測器

# 讨论
source: Discussion
ja: 相談
ko: 논의
ru: Обсуждение
zh_hans: 讨论
zh_hant: 討論

# 讨论决定
source: Discussion decision
ja: 相談で決定
ko: 논의로 결정
ru: Решение по обсуждению
zh_hans: 讨论决定
zh_hant: 討論決定

# 讨论归档
source: Archive discussion
ja: 相談をアーカイブ
ko: 논의 보관
ru: Архивировать обсуждение
zh_hans: 讨论归档
zh_hant: 討論歸檔

# 讨论归档后
source: After discussion is archived
ja: 相談アーカイブ後
ko: 논의 보관 후
ru: После архивирования обсуждения
zh_hans: 讨论归档后
zh_hant: 討論歸檔後

# 讨论摘要
source: Discussion summary
ja: 議論の概要
ko: 토론 요약
ru: Сводка обсуждения
zh_hans: 讨论摘要
zh_hant: 討論摘要

# 讨论模式
source: Discussion mode
ja: 議論モード
ko: 토론 모드
ru: Режим обсуждения
zh_hans: 讨论模式
zh_hant: 討論模式

# 讨论用的文件副本没写上（%@）。书本身已保存，下次改书时会再试。
source: The discussion file copy couldn't be written (%@). The book itself was saved; we'll try again the next time you edit it.
ja: 議論用ファイルのコピーを書き込めませんでした（%@）。小説自体は保存済みです。次回の編集時に再試行します。
ko: 토론용 파일 사본을 저장하지 못했습니다(%@). 책 자체는 저장되었고, 다음에 책을 수정할 때 다시 시도합니다.
ru: Копию файла для обсуждения не удалось записать (%@). Книга сохранена; при следующем изменении книги будет выполнена повторная попытка.
zh_hans: 讨论所用的文件副本未能写入（%@）。书本身已保存，下次修改书籍时会重试。
zh_hant: 討論用的檔案副本未寫入（%@）。書本身已儲存，下次修改書籍時會再試。

# 讨论结束后可查看历史议会
source: View council history after the discussion ends
ja: 議論の終了後に過去の議会を確認できます
ko: 토론 후 이전 의회를 볼 수 있습니다
ru: После завершения обсуждения можно просмотреть историю совета
zh_hans: 讨论结束后可查看历史议会
zh_hant: 討論結束後可查看歷史議會

# 讨论规划
source: Discussion planning
ja: 議論の計画
ko: 논의 계획
ru: План обсуждения
zh_hans: 讨论规划
zh_hant: 討論規劃

# 议会已完成
source: Council complete
ja: 議会が完了しました
ko: 의회 완료
ru: Совет завершён
zh_hans: 议会已完成
zh_hant: 議會已完成

# 议会设置
source: Council settings
ja: 議会設定
ko: 의회 설정
ru: Настройки совета
zh_hans: 议会设置
zh_hant: 議會設定

# 议会详情
source: Council details
ja: 議会の詳細
ko: 의회 세부 정보
ru: Сведения о совете
zh_hans: 议会详情
zh_hant: 議會詳情

# 记忆库
source: Memory library
ja: メモリライブラリ
ko: 기억 저장소
ru: Библиотека памяти
zh_hans: 记忆库
zh_hant: 記憶庫

# 记忆范围
source: Memory scope
ja: メモリの範囲
ko: 기억 범위
ru: Область памяти
zh_hans: 记忆范围
zh_hant: 記憶範圍

# 设为主分支
source: Set as main branch
ja: メインブランチに設定
ko: 기본 브랜치로 설정
ru: Сделать главной веткой
zh_hans: 设为主分支
zh_hant: 設為主分支

# 设为当前
source: Set as current
ja: 現在に設定
ko: 현재 항목으로 설정
ru: Сделать текущим
zh_hans: 设为当前
zh_hant: 設為目前

# 设备
source: Device
ja: デバイス
ko: 기기
ru: Устройство
zh_hans: 设备
zh_hant: 裝置

# 设备与网络
source: Device & Network
ja: デバイスとネットワーク
ko: 기기 및 네트워크
ru: Устройство и сеть
zh_hans: 设备与网络
zh_hant: 裝置與網路

# 设定
source: Setting
ja: 設定
ko: 설정
ru: Настройки
zh_hans: 设定
zh_hant: 設定

# 设定分类
source: Setting category
ja: 設定カテゴリ
ko: 설정 분류
ru: Категория настроек
zh_hans: 设定分类
zh_hant: 設定分類

# 设定建议
source: Setting suggestions
ja: 設定案
ko: 설정 제안
ru: Предложение по настройкам
zh_hans: 设定建议
zh_hant: 設定建議

# 设定条目
source: Setting entry
ja: 設定項目
ko: 설정 항목
ru: Элемент настроек
zh_hans: 设定条目
zh_hant: 設定項目

# 设置
source: Settings
ja: 設定
ko: 설정
ru: Настройки
zh_hans: 设置
zh_hant: 設定

# 设置会保存到本机，下一轮议会使用。
source: Settings are saved locally for the next council round.
ja: 設定はこのデバイスに保存され、次回の議会で使用されます。
ko: 설정은 이 기기에 저장되며 다음 의회에서 사용됩니다.
ru: Настройки сохранятся на устройстве и будут использованы в следующем раунде совета.
zh_hans: 设置会保存到本机，下一轮议会使用。
zh_hant: 設定會儲存至本機，下一輪議會使用。

# 访问公开 https 页面
source: Access public HTTPS page
ja: 公開 https ページにアクセス
ko: 공개 https 페이지에 액세스
ru: Открыть публичную https-страницу
zh_hans: 访问公开 https 页面
zh_hant: 存取公開 https 頁面

# 访问局域网设备时由 iOS 弹出确认
source: iOS shows a confirmation when accessing devices on your local network
ja: ローカルネットワーク上のデバイスにアクセスすると、iOS が確認を表示します。
ko: 로컬 네트워크 기기에 접근하면 iOS에서 확인을 요청합니다.
ru: При доступе к устройствам в локальной сети iOS покажет запрос подтверждения
zh_hans: 访问局域网设备时由 iOS 弹出确认
zh_hant: 存取區域網路裝置時由 iOS 顯示確認提示

# 试听
source: Preview
ja: 試聴
ko: 미리 듣기
ru: Прослушать
zh_hans: 试听
zh_hant: 試聽

# 试穿主题
source: Try on theme
ja: テーマを試す
ko: 테마 적용해 보기
ru: Примерить тему
zh_hans: 试穿主题
zh_hant: 試穿主題

# 该作业记录已不存在。
source: This job record no longer exists.
ja: このジョブの記録は存在しません。
ko: 이 작업 기록은 더 이상 존재하지 않습니다.
ru: Запись задания больше не существует.
zh_hans: 该作业记录已不存在。
zh_hant: 此工作記錄已不存在。

# 该分支将重新使用项目资料的当前版本。
source: This branch will use the current version of the project materials again.
ja: このブランチでは、プロジェクト資料の現在のバージョンを再利用します。
ko: 이 브랜치는 프로젝트 자료의 현재 버전을 다시 사용합니다.
ru: Эта ветка снова будет использовать текущую версию материалов проекта.
zh_hans: 该分支将重新使用项目资料的当前版本。
zh_hant: 此分支將重新使用專案資料的目前版本。

# 该失败不能直接重试
source: This failure cannot be retried directly
ja: この失敗は直接再試行できません
ko: 이 실패는 바로 다시 시도할 수 없습니다.
ru: После этой ошибки нельзя сразу повторить попытку
zh_hans: 该失败不能直接重试
zh_hant: 此失敗無法直接重試

# 语速
source: Speech rate
ja: 読み上げ速度
ko: 말하기 속도
ru: Скорость речи
zh_hans: 语速
zh_hant: 語速

# 语音 / 短回答
source: Voice / short answer
ja: 音声 / 短文回答
ko: 음성 / 짧은 답변
ru: Голос / краткий ответ
zh_hans: 语音 / 短回答
zh_hant: 語音 / 簡短回答

# 语音合成
source: Speech synthesis
ja: 音声合成
ko: 음성 합성
ru: Синтез речи
zh_hans: 语音合成
zh_hant: 語音合成

# 语音回答
source: Voice response
ja: 音声で回答
ko: 음성 답변
ru: Голосовой ответ
zh_hans: 语音回答
zh_hant: 語音回答

# 语音服务
source: Voice Services
ja: 音声サービス
ko: 음성 서비스
ru: Голосовые сервисы
zh_hans: 语音服务
zh_hant: 語音服務

# 语音识别
source: Speech Recognition
ja: 音声認識
ko: 음성 인식
ru: Распознавание речи
zh_hans: 语音识别
zh_hant: 語音辨識

# 说明
source: Description
ja: 説明
ko: 설명
ru: Пояснение
zh_hans: 说明
zh_hant: 說明

# 请先停止当前生成
source: Stop the current generation first
ja: 現在の生成を停止してからお試しください
ko: 먼저 현재 생성을 중지하세요.
ru: Сначала остановите текущую генерацию
zh_hans: 请先停止当前生成
zh_hant: 請先停止目前產生

# 请先同步剧情状态
source: Sync the story state first
ja: 先にプロット状態を同期してください
ko: 먼저 스토리 상태를 동기화하세요.
ru: Сначала синхронизируйте состояние сюжета
zh_hans: 请先同步剧情状态
zh_hant: 請先同步劇情狀態

# 请先同步手动改写，再撤销上一次操作。
source: Sync the manual rewrite first, then undo the previous action.
ja: まず手動リライトを同期してから、前回の操作を取り消してください。
ko: 먼저 수동 재작성을 동기화한 후 마지막 작업을 되돌리세요.
ru: Сначала синхронизируйте ручное переписывание, затем отменяйте последнее действие.
zh_hans: 请先同步手动改写，再撤销上一次操作。
zh_hant: 請先同步手動改寫，再撤銷上一次操作。

# 请先在 Gemini 服务商设置里用 Google 账号登录 Antigravity，再发送消息。
source: In Gemini provider settings, sign in to Antigravity with your Google account before sending a message.
ja: Gemini サービスプロバイダーの設定で Google アカウントを使って Antigravity にログインしてから、メッセージを送信してください。
ko: 먼저 Gemini 서비스 제공자 설정에서 Google 계정으로 Antigravity에 로그인한 후 메시지를 보내세요.
ru: Сначала войдите в Antigravity с аккаунтом Google в настройках провайдера Gemini, затем отправьте сообщение.
zh_hans: 请先在 Gemini 服务商设置里用 Google 账号登录 Antigravity，再发送消息。
zh_hant: 請先在 Gemini 服務提供者設定中使用 Google 帳號登入 Antigravity，再傳送訊息。

# 请先在 xAI 服务商设置里用 Grok 账号登录，再发送消息。
source: In xAI provider settings, sign in with your Grok account before sending a message.
ja: xAI サービスプロバイダーの設定で Grok アカウントにログインしてから、メッセージを送信してください。
ko: 먼저 xAI 서비스 제공자 설정에서 Grok 계정으로 로그인한 후 메시지를 보내세요.
ru: Сначала войдите с аккаунтом Grok в настройках провайдера xAI, затем отправьте сообщение.
zh_hans: 请先在 xAI 服务商设置里用 Grok 账号登录，再发送消息。
zh_hant: 請先在 xAI 服務提供者設定中使用 Grok 帳號登入，再傳送訊息。

# 请先在「默认模型 → 辅助任务」配置视觉识别模型
source: First configure a visual-recognition model in “Default Model → Auxiliary Tasks”
ja: まず「デフォルトモデル → 補助タスク」で視覚認識モデルを設定してください
ko: 먼저 「기본 모델 → 보조 작업」에서 시각 인식 모델을 구성하세요.
ru: Сначала настройте модель визуального распознавания в «Модели по умолчанию → Вспомогательные задачи»
zh_hans: 请先在「默认模型 → 辅助任务」配置视觉识别模型
zh_hant: 請先在「預設模型 → 輔助任務」設定視覺辨識模型

# 请先在服务商设置里启用当前服务商，再发送消息。
source: Enable the current provider in provider settings before sending a message.
ja: サービスプロバイダーの設定で現在のサービスプロバイダーを有効にしてから、メッセージを送信してください。
ko: 먼저 서비스 제공자 설정에서 현재 서비스 제공자를 활성화한 후 메시지를 보내세요.
ru: Сначала включите текущего провайдера в его настройках, затем отправьте сообщение.
zh_hans: 请先在服务商设置里启用当前服务商，再发送消息。
zh_hant: 請先在服務提供者設定中啟用目前的服務提供者，再傳送訊息。

# 请先在服务商设置里用 ChatGPT 账号登录 Codex，再发送消息。
source: In provider settings, sign in to Codex with your ChatGPT account before sending a message.
ja: サービスプロバイダーの設定で ChatGPT アカウントを使って Codex にログインしてから、メッセージを送信してください。
ko: 먼저 서비스 제공자 설정에서 ChatGPT 계정으로 Codex에 로그인한 후 메시지를 보내세요.
ru: Сначала войдите в Codex с аккаунтом ChatGPT в настройках провайдера, затем отправьте сообщение.
zh_hans: 请先在服务商设置里用 ChatGPT 账号登录 Codex，再发送消息。
zh_hant: 請先在服務提供者設定中使用 ChatGPT 帳號登入 Codex，再傳送訊息。

# 请先在服务商详情自动获取或手动添加模型。
source: In Provider details, first fetch models automatically or add one manually.
ja: 先にプロバイダーの詳細画面でモデルを自動取得するか、手動で追加してください。
ko: 먼저 서비스 제공업체 세부 정보에서 모델을 자동으로 가져오거나 수동으로 추가하세요.
ru: Сначала загрузите список моделей автоматически или добавьте их вручную в сведениях о поставщике.
zh_hans: 请先在服务商详情自动获取或手动添加模型。
zh_hant: 請先在服務提供者詳情中自動取得或手動新增模型。

# 请先在设置里添加一个服务商（并填写 API Key 与模型），再发送消息。
source: Add a provider in Settings (including an API key and model) before sending a message.
ja: 設定でサービスプロバイダーを追加し（API Key とモデルを入力）、メッセージを送信してください。
ko: 먼저 설정에서 서비스 제공자를 추가하고(API Key와 모델을 입력한 후) 메시지를 보내세요.
ru: Сначала добавьте провайдера в настройках (укажите API Key и модель), затем отправьте сообщение.
zh_hans: 请先在设置里添加一个服务商（并填写 API Key 与模型），再发送消息。
zh_hant: 請先在設定中新增服務提供者（並填寫 API Key 與模型），再傳送訊息。

# 请先处理上次润色检查
source: Complete the previous polish review first
ja: 前回の推敲チェックを先に処理してください
ko: 먼저 이전 다듬기 검사를 처리하세요.
ru: Сначала завершите прошлую проверку правок
zh_hans: 请先处理上次润色检查
zh_hant: 請先處理上次的潤飾檢查

# 请先完成当前分支的正文操作
source: Complete the current branch's manuscript operation first
ja: 現在のブランチの本文操作を先に完了してください
ko: 먼저 현재 브랜치의 본문 작업을 완료하세요.
ru: Сначала завершите операцию с основным текстом текущей ветки
zh_hans: 请先完成当前分支的正文操作
zh_hant: 請先完成目前分支的正文操作

# 请先添加服务商 API Key，再发送第一条消息。
source: Add a provider API key before sending your first message.
ja: サービスプロバイダーの API Key を追加してから、最初のメッセージを送信してください。
ko: 먼저 서비스 제공자의 API Key를 추가한 후 첫 메시지를 보내세요.
ru: Сначала добавьте API Key провайдера, затем отправьте первое сообщение.
zh_hans: 请先添加服务商 API Key，再发送第一条消息。
zh_hant: 請先新增服務提供者 API Key，再傳送第一則訊息。

# 请先输入或语音识别内容
source: Enter content or use voice input first
ja: まず入力するか、音声認識を行ってください
ko: 먼저 입력하거나 음성으로 인식해 주세요.
ru: Сначала введите текст или продиктуйте его
zh_hans: 请先输入或语音识别内容
zh_hant: 請先輸入內容或進行語音辨識

# 请先选择文件。
source: Select a file first.
ja: 先にファイルを選択してください。
ko: 먼저 파일을 선택하세요.
ru: Сначала выберите файл.
zh_hans: 请先选择文件。
zh_hant: 請先選擇檔案。

# 请先选择模型
source: Select a model first
ja: 先にモデルを選択してください
ko: 먼저 모델을 선택하세요.
ru: Сначала выберите модель
zh_hans: 请先选择模型
zh_hant: 請先選擇模型

# 请先选择选项、跳过或语音输入
source: Select an option, skip, or use voice input first
ja: まず選択肢を選ぶか、スキップするか、音声入力してください
ko: 먼저 옵션을 선택하거나 건너뛰거나 음성으로 입력하세요.
ru: Сначала выберите вариант, пропустите шаг или введите ответ голосом
zh_hans: 请先选择选项、跳过或语音输入
zh_hant: 請先選擇選項、略過或使用語音輸入

# 请先重新载入项目
source: Reload the project first
ja: プロジェクトを再読み込みしてください
ko: 먼저 프로젝트를 다시 로드하세요.
ru: Сначала перезагрузите проект
zh_hans: 请先重新载入项目
zh_hant: 請先重新載入專案

# 请填写完整的章节标题和正文。
source: Fill in both the chapter title and manuscript.
ja: 章タイトルと本文を入力してください。
ko: 장 제목과 본문을 모두 입력하세요.
ru: Заполните заголовок главы и основной текст полностью.
zh_hans: 请填写完整的章节标题和正文。
zh_hant: 請填寫完整的章節標題和正文。

# 请填写完整的资料标题和内容。
source: Fill in both the material title and content.
ja: 資料のタイトルと内容を入力してください。
ko: 자료 제목과 내용을 모두 입력하세요.
ru: Заполните заголовок и содержимое материала полностью.
zh_hans: 请填写完整的资料标题和内容。
zh_hant: 請填寫完整的資料標題和內容。

# 请求伪装
source: Request spoofing
ja: リクエスト偽装
ko: 요청 위장
ru: Маскировка запроса
zh_hans: 请求伪装
zh_hant: 請求偽裝

# 请求失败。请检查服务商配置后重试。
source: Request failed. Check the provider configuration and try again.
ja: リクエストに失敗しました。サービスプロバイダーの設定を確認して再試行してください。
ko: 요청에 실패했습니다. 서비스 제공자 설정을 확인한 후 다시 시도하세요.
ru: Запрос не выполнен. Проверьте настройки провайдера и повторите попытку.
zh_hans: 请求失败。请检查服务商配置后重试。
zh_hant: 請求失敗。請檢查服務提供者設定後重試。

# 请求头
source: Request headers
ja: リクエストヘッダー
ko: 요청 헤더
ru: Заголовки запроса
zh_hans: 请求头
zh_hant: 要求標頭

# 请求尚未发送，因为本地运行记录写入失败。请重试；若问题持续，请检查设备可用存储空间。
source: The request was not sent because the local run record couldn't be written. Try again; if the problem persists, check the device's available storage.
ja: ローカル実行記録の書き込みに失敗したため、リクエストは送信されませんでした。再試行してください。問題が続く場合は、デバイスの空きストレージ容量を確認してください。
ko: 로컬 실행 기록 쓰기에 실패하여 요청을 보내지 않았습니다. 다시 시도하세요; 문제가 계속되면 기기의 사용 가능한 저장 공간을 확인하세요.
ru: Запрос не отправлен: не удалось записать локальный журнал выполнения. Повторите попытку; если проблема сохраняется, проверьте свободное место на устройстве.
zh_hans: 请求尚未发送，因为本地运行记录写入失败。请重试；若问题持续，请检查设备可用存储空间。
zh_hant: 請求尚未傳送，因為本機執行記錄寫入失敗。請重試；若問題持續，請檢查裝置可用的儲存空間。

# 请求模型 ID
source: Model ID to request
ja: リクエストモデル ID
ko: 요청 모델 ID
ru: ID запрашиваемой модели
zh_hans: 请求模型 ID
zh_hant: 請求模型 ID

# 请求超时，请稍后重试。
source: Request timed out. Please try again later.
ja: リクエストがタイムアウトしました。後でもう一度お試しください。
ko: 요청 시간이 초과되었습니다. 나중에 다시 시도하세요.
ru: Время ожидания запроса истекло. Повторите позже.
zh_hans: 请求超时，请稍后重试。
zh_hant: 請求逾時，請稍後重試。

# 请求过于频繁，请稍后重试。
source: Too many requests. Please try again later.
ja: リクエストが多すぎます。後でもう一度お試しください。
ko: 요청이 너무 잦습니다. 나중에 다시 시도하세요.
ru: Слишком много запросов. Повторите позже.
zh_hans: 请求过于频繁，请稍后重试。
zh_hant: 請求過於頻繁，請稍後重試。

# 请稍后重试。
source: Please try again later.
ja: 後でもう一度お試しください。
ko: 나중에 다시 시도하세요.
ru: Повторите позже.
zh_hans: 请稍后重试。
zh_hant: 請稍後重試。

# 请等当前回复结束后再修改图片
source: Wait for the current response to finish before editing the image
ja: 現在の返信が終わるまで画像を変更しないでください
ko: 현재 응답이 끝난 후에 이미지를 수정하세요.
ru: Дождитесь завершения текущего ответа, затем изменяйте изображение
zh_hans: 请等当前回复结束后再修改图片
zh_hant: 請等目前回覆結束後再修改圖片

# 请选择一个资料版本。
source: Select a material version.
ja: 資料のバージョンを1つ選択してください。
ko: 자료 버전을 하나 선택하세요.
ru: Выберите версию материала.
zh_hans: 请选择一个资料版本。
zh_hant: 請選擇一個資料版本。

# 请选择一个选项或输入你的想法。
source: Select an option or enter your idea.
ja: 選択肢を1つ選ぶか、考えを入力してください。
ko: 옵션을 하나 선택하거나 생각을 입력하세요.
ru: Выберите вариант или введите свою идею.
zh_hans: 请选择一个选项或输入你的想法。
zh_hant: 請選擇一個選項或輸入你的想法。

# 请选择当前服务商可用的聊天模型，或填写服务商文档中的 Model ID。
source: Select a chat model available for the current provider, or enter the Model ID from the provider's documentation.
ja: 現在のサービスプロバイダーで利用可能なチャットモデルを選択するか、サービスプロバイダーのドキュメントに記載された Model ID を入力してください。
ko: 현재 서비스 제공자가 사용할 수 있는 채팅 모델을 선택하거나 서비스 제공자 문서의 Model ID를 입력하세요.
ru: Выберите доступную для текущего провайдера модель чата или укажите Model ID из документации провайдера.
zh_hans: 请选择当前服务商可用的聊天模型，或填写服务商文档中的 Model ID。
zh_hant: 請選擇目前服務提供者可用的聊天模型，或填寫服務提供者文件中的 Model ID。

# 请选择资料类型
source: Select a material type
ja: 資料の種類を選択してください
ko: 자료 유형을 선택하세요
ru: Выберите тип материала
zh_hans: 请选择资料类型
zh_hant: 請選擇資料類型

# 读写自身命名空间的共享数据
source: Read and write shared data in its own namespace
ja: 自身の名前空間の共有データを読み書き
ko: 자체 네임스페이스의 공유 데이터 읽기 및 쓰기
ru: Читать и записывать общие данные собственного пространства имён
zh_hans: 读写自身命名空间的共享数据
zh_hant: 讀寫自身命名空間的共用資料

# 读写该小应用自己的本地数据
source: Read and write this mini app's local data
ja: このミニアプリ自身のローカルデータを読み書き
ko: 이 MiniApp의 로컬 데이터 읽기 및 쓰기
ru: Читать и записывать локальные данные этого мини-приложения
zh_hans: 读写该小应用自己的本地数据
zh_hant: 讀寫這個小應用自己的本機資料

# 读取
source: Read
ja: 読み込む
ko: 읽기
ru: Прочитать
zh_hans: 读取
zh_hant: 讀取

# 读取 Workspace
source: Read Workspace
ja: Workspace を読み取る
ko: Workspace 읽기
ru: Читать Workspace
zh_hans: 读取 Workspace
zh_hant: 讀取 Workspace

# 读取上下文
source: Read context
ja: コンテキストを読み込み
ko: 컨텍스트 읽기
ru: Чтение контекста
zh_hans: 读取上下文
zh_hant: 讀取上下文

# 读取列表
source: Read list
ja: リストを読み込み
ko: 목록 읽기
ru: Чтение списка
zh_hans: 读取列表
zh_hant: 讀取清單

# 读取剪贴板
source: Read clipboard
ja: クリップボードを読み取る
ko: 클립보드 읽기
ru: Чтение буфера обмена
zh_hans: 读取剪贴板
zh_hant: 讀取剪貼簿

# 读取剪贴板文本
source: Read clipboard text
ja: クリップボードのテキストを読み取る
ko: 클립보드 텍스트 읽기
ru: Читать текст из буфера обмена
zh_hans: 读取剪贴板文本
zh_hant: 讀取剪貼簿文字

# 读取和创建提醒事项需要系统授权
source: System permission is required to read and create reminders
ja: リマインダーの読み取りと作成にはシステムの許可が必要です。
ko: 미리 알림을 읽고 생성하려면 시스템 권한이 필요합니다.
ru: Для чтения и создания напоминаний требуется системное разрешение
zh_hans: 读取和创建提醒事项需要系统授权
zh_hant: 讀取和建立提醒事項需要系統授權

# 读取和创建日历事件需要 EventKit 授权
source: EventKit permission is required to read and create calendar events
ja: カレンダーイベントの読み取りと作成には EventKit の許可が必要です。
ko: 캘린더 이벤트를 읽고 생성하려면 EventKit 권한이 필요합니다.
ru: Для чтения и создания событий календаря требуется разрешение EventKit
zh_hans: 读取和创建日历事件需要 EventKit 授权
zh_hant: 讀取和建立行事曆事件需要 EventKit 授權

# 读取失败
source: Read failed
ja: 読み込みに失敗しました
ko: 읽기 실패
ru: Ошибка чтения
zh_hans: 读取失败
zh_hant: 讀取失敗

# 读取当前主题色
source: Read the current theme color
ja: 現在のテーマカラーを読み取る
ko: 현재 테마 색상 읽기
ru: Читать текущий цвет темы
zh_hans: 读取当前主题色
zh_hant: 讀取目前主題色

# 读取当前位置
source: Read the current location
ja: 現在地を読み取る
ko: 현재 위치 읽기
ru: Читать текущее местоположение
zh_hans: 读取当前位置
zh_hant: 讀取目前位置

# 读取或更新联系人前会先申请系统授权
source: System permission is requested before reading or updating contacts
ja: 連絡先の読み取りまたは更新前に、システムの許可を求めます。
ko: 연락처를 읽거나 업데이트하기 전에 시스템 권한을 요청합니다.
ru: Перед чтением или обновлением контактов будет запрошено системное разрешение
zh_hans: 读取或更新联系人前会先申请系统授权
zh_hant: 讀取或更新聯絡人前會先申請系統授權

# 读取文件失败：%@
source: Failed to read file: %@
ja: ファイルの読み取りに失敗しました：%@
ko: 파일 읽기 실패: %@
ru: Не удалось прочитать файл: %@
zh_hans: 读取文件失败：%@
zh_hant: 讀取檔案失敗：%@

# 读取最小化会话上下文
source: Read minimal session context
ja: 最小限のセッションコンテキストを読み取る
ko: 최소화된 세션 컨텍스트 읽기
ru: Читать минимальный контекст сеанса
zh_hans: 读取最小化会话上下文
zh_hant: 讀取最小化會話上下文

# 读取服务器公钥的 SHA256 指纹，请稍候。
source: Reading the server public-key SHA256 fingerprint. Please wait.
ja: サーバー公開鍵の SHA256 フィンガープリントを読み取っています。しばらくお待ちください。
ko: 서버 공개 키의 SHA256 지문을 읽는 중입니다. 잠시 기다려 주세요.
ru: Получаем отпечаток SHA256 открытого ключа сервера. Подождите.
zh_hans: 读取服务器公钥的 SHA256 指纹，请稍候。
zh_hant: 正在讀取伺服器公開金鑰的 SHA256 指紋，請稍候。

# 读取网页
source: Read webpage
ja: ウェブページを読み取る
ko: 웹페이지 읽기
ru: Читать веб-страницу
zh_hans: 读取网页
zh_hant: 讀取網頁

# 调度子代理
source: Schedule subagent
ja: サブエージェントを起動
ko: SubAgent 호출
ru: Назначить субагента
zh_hans: 调度子代理
zh_hant: 調度子代理

# 调整段落后会保留你的编辑；如需按当前选择重新生成正文，请点“按当前选择重置”。
source: Your edits will be kept after adjusting the paragraphs; to regenerate the manuscript using the current selection, tap “Reset to current selection.”
ja: 段落を調整しても編集内容は保持されます。現在の選択に基づいて本文を再生成するには、「現在の選択でリセット」をタップしてください。
ko: 단락을 조정해도 편집 내용은 유지됩니다. 현재 선택에 따라 본문을 다시 생성하려면 “현재 선택으로 재설정”을 탭하세요.
ru: После изменения абзацев ваши правки сохранятся; чтобы заново сгенерировать текст по текущему выбору, нажмите «Сбросить по текущему выбору».
zh_hans: 调整段落后会保留你的编辑；如需按当前选择重新生成正文，请点“按当前选择重置”。
zh_hant: 調整段落後會保留你的編輯；如需依目前選擇重新產生正文，請點選「依目前選擇重設」。

# 调用 AI
source: Call AI
ja: AI を呼び出す
ko: AI 호출
ru: Вызов AI
zh_hans: 调用 AI
zh_hant: 呼叫 AI
